parallel/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.01 0 0);

boundaryField
{
    xm
    {
        type            fixedValue;
        value           uniform (0.01 0 0);
    }

    xp
    {
        type            inletOutlet;
        inletValue      uniform (0.01 0 0);
	value           $internalField;
    }

    ym
    {
        type            slip;
    }

    yp
    {
        type            slip;
    }

    zm
    {
        type            slip;
    }

    zp
    {
        type            slip;
    }

    sphere
    {
        type            noSlip;
    }
}


// ************************************************************************* //
